Catalogs/РС_КонтрагентыОбмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_КонтрагентыОбмен</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОКВЭД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКВЭД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РС_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетКИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ликвидирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РС_ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеОКВЭД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКВЭД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РС_КонтрагентыОбмен/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти   

#Область ОбработчикиКомандФормы 

 &НаКлиенте
Процедура КомандаЗаполнитьСправочник(Команда)
	КомандаЗаполнитьСправочникНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОКВЕД2(Команда)
	ЗаполнитьОКВЕД2НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбработать(Команда)
	Массив = Элементы.Список.ВыделенныеСтроки;
	КомандаОбработатьНаСервере(Массив);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолноеНаименование(Команда) 
	Массив = Элементы.Список.ВыделенныеСтроки;
	ЗаполнитьПолноеНаименованиеНаСервере(Массив);
КонецПроцедуры

&НаКлиенте
Процедура НетКИ(Команда)
	НетКИНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВФЛ(Команда) 
	Массив = Элементы.Список.ВыделенныеСтроки;
	ПеренестиВФЛНаСервере(Массив);
КонецПроцедуры 

&НаКлиенте
 Процедура ПустоеПредставление(Команда)
	 ПустоеПредставлениеНаСервере();
 КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция НайтиКонтрагентаПоИННКПП(Структура)
	
	нКонрагент = Справочники.РС_Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС_Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.РС_Контрагенты КАК РС_Контрагенты
		|ГДЕ
		|	РС_Контрагенты.ИНН = &ИНН
		|	И РС_Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", Структура.ИНН);
	Запрос.УстановитьПараметр("КПП", Структура.КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 нКонрагент = ВыборкаДетальныеЗаписи.Контрагент;
	КонецЦикла;
	
	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Процедура КомандаЗаполнитьСправочникНаСервере()
		
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);	
		Структура.Вставить("КонтрагентБД"		, ВыборкаДетальныеЗаписи.Ссылка);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
								
		РС_ОбщийМодульСервер.ЗаполнитьКИ(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры	

&НаСервере
Функция СоздатьКонтрагентаРС(Структура)
			
	ПоискКонтрагент = НайтиКонтрагента(Структура);
	
	Если ЗначениеЗаполнено(ПоискКонтрагент) Тогда 
		Если Структура.НетКИ = Ложь Тогда
			Структура.Вставить("ПоискКонтрагент", ПоискКонтрагент);
			ЗаполнитьКИ(Структура);
		КонецЕсли;
	Иначе 	
		НовыйЭлемент = Справочники.РС_Контрагенты.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Структура); 
		
		НовыйЭлемент.Записать();
		
		РС_ОбщийМодульСервер.ЗаполнитьКИ(НовыйЭлемент.Ссылка, Структура.КонтрагентОбмена);
	КонецЕсли;   
	
	Возврат ПоискКонтрагент;
	
КонецФункции	   

&НаСервере
Функция НайтиКонтрагента(Структура) 
	
	нКонрагент = Справочники.РС_Контрагенты.ПустаяСсылка();
	
	КонтрагентПоИННКПП = НайтиКонтрагентаПоИННКПП(Структура);
	
	Если ЗначениеЗаполнено(КонтрагентПоИННКПП) Тогда 
		нКонрагент = КонтрагентПоИННКПП;	
	Иначе 
		нКонрагент = Справочники.РС_Контрагенты.НайтиПоНаименованию(Структура.Наименование);	
	КонецЕсли;

	Возврат нКонрагент;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОКВЕД2НаСервере()
	
	ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентов();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, ВыборкаДетальныеЗаписи.Наименование);
		Структура.Вставить("НаименованиеПолное"	, ВыборкаДетальныеЗаписи.НаименованиеПолное);
		Структура.Вставить("ИНН"				, ВыборкаДетальныеЗаписи.ИНН);
		Структура.Вставить("КПП"				, ВыборкаДетальныеЗаписи.КПП);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);
		
		ПараметрыОтчета = Новый Структура;   
		
		ПараметрыОтчета.Вставить("ИНН"							,ВыборкаДетальныеЗаписи.ИНН);
		ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
		ПараметрыОтчета.Вставить("Контрагент"					,ВыборкаДетальныеЗаписи.Ссылка);
		ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
		ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
		ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
		ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");
		
		РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);
		
		РС_ОбщийМодульСервер.ЗаполнитьОКВЕД2(КонтрагентРС, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	   
	
КонецПроцедуры

 &НаСервере
Процедура КомандаОбработатьНаСервере(Массив) 
	
	Для Каждого СтрМассив Из Массив Цикл 
		Структура = Новый Структура;
		Структура.Вставить("Наименование"		, СтрМассив.Наименование);
		Структура.Вставить("НаименованиеПолное"	, СтрМассив.НаименованиеПолное);
		Структура.Вставить("ИНН"				, СтрМассив.ИНН);
		Структура.Вставить("КПП"				, СтрМассив.КПП);
		Структура.Вставить("КонтрагентОбмена"	, СтрМассив);
		Структура.Вставить("НетКИ"				, СтрМассив.НетКИ);
		
		КонтрагентРС = СоздатьКонтрагентаРС(Структура);	
					
		СпрОбъект = СтрМассив.ПолучитьОбъект();
		СпрОбъект.Обработан = Истина;
		СпрОбъект.Записать();		
	КонецЦикла;	  
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолноеНаименованиеНаСервере(Массив)  
	Для Каждого СтрМассив Из Массив Цикл
		Если Не СтрМассив.Обработан И Не ЗначениеЗаполнено(СтрМассив.НаименованиеПолное) Тогда  
			СпрОбъект = СтрМассив.ПолучитьОбъект();
            СпрОбъект.НаименованиеПолное = СпрОбъект.Наименование;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура НетКИНаСервере()
	Выборка = Справочники.РС_КонтрагентыОбмен.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.КонтактнаяИнформация.Количество() = 0 Тогда 
			СпрОбъект = Выборка.ПолучитьОбъект();
			СпрОбъект.НетКИ = Истина;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВФЛНаСервере(Массив) 
	
	Для Каждого СтрМассив Из Массив Цикл
		СоздатьФизЛицоРС(СтрМассив);	
		
		СпрОбъект = СтрМассив.ПолучитьОбъект();
		СпрОбъект.Обработан = Истина;
		СпрОбъект.Записать();		  	
	КонецЦикла;  

	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура СоздатьФизЛицоРС(СтрМассива)
	 
	 Если ЗначениеЗаполнено(СтрМассива.Источник) Тогда 
		 Источник =  СтрМассива.Источник;
	 Иначе	 
		 Источник = РС_ОбщийМодульСервер.СоздатьИсточникЭтаБаза();
	 КонецЕсли; 
	 
	 Фамилия 	= "";
	 Имя 		= "";
	 Отчество 	= "";
	 
	 МассивСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрМассива.Наименование, " "); 
	 
	 Если МассивСтроки.Количество() > 0 Тогда 
		 Если МассивСтроки.Количество() >= 3 Тогда  				
			 Фамилия 	= МассивСтроки[0];
			 Имя 		= МассивСтроки[1];
			 Отчество 	= МассивСтроки[2];
		 ИначеЕсли МассивСтроки.Количество() = 2 Тогда 
			 Фамилия 	= МассивСтроки[1];
			 Имя 		= МассивСтроки[0];
		 ИначеЕсли МассивСтроки.Количество() = 1 Тогда 
			 Имя 		= МассивСтроки[0];
		 Иначе 	
		 КонецЕсли;
	 КонецЕсли;
	 
	 Структура = Новый Структура;
	 Структура.Вставить("ДатаРождения"	,Дата(1,1,1));
	 Структура.Вставить("Имя"			,Имя);
	 Структура.Вставить("ИНН"			,СтрМассива.ИНН);
	 Структура.Вставить("Отчество"		,Отчество);
	 Структура.Вставить("Фамилия"		,Фамилия); 
	 Структура.Вставить("Источник"		,Источник);
	 Структура.Вставить("Контрагент"	,"");
	  
	 ПоискФЛ = РС_ОбщийМодульСервер.НайтиФизЛицо(Структура);
	 
	 Если Не ЗначениеЗаполнено(ПоискФЛ) Тогда 
		 НовыйЭлемент = Справочники.РС_ФизическиеЛица.СоздатьЭлемент(); 
		 НовыйЭлемент.ДатаРождения 	= Дата(1,1,1);
		 НовыйЭлемент.Имя 	  		= Имя; 
		 НовыйЭлемент.Источник      = Источник;
		 НовыйЭлемент.Наименование  = СтрМассива.Наименование;
		 НовыйЭлемент.НетКИ         = СтрМассива.НетКИ;
		 НовыйЭлемент.Отчество 		= Отчество; 
		 НовыйЭлемент.Фамилия       = Фамилия; 
		 НовыйЭлемент.ФИО = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество);
		 
		 НовыйЭлемент.Записать();
		    
		 ПоискФЛ = НовыйЭлемент.Ссылка;
		     
		 Для Каждого СтрКИ Из СтрМассива.КонтактнаяИнформация Цикл 
		    	 
		  	 НовяСтрока = НовыйЭлемент.КонтактнаяИнформация.Добавить();
		   	 ЗаполнитьЗначенияСвойств(НовяСтрока, СтрКИ);
		   	 
		 КонецЦикла;
		 
		 Попытка
			 НовыйЭлемент.Записать();
			 
			 спрОбъект = СтрМассива.Ссылка.ПолучитьОбъект();
			 спрОбъект.Обработан = Истина;
			 спрОбъект.Записать();
		 Исключение
		 КонецПопытки;
	 КонецЕсли;
	 
 КонецПроцедуры
 
 &НаСервере
 //Структура
  //Наименование
 //НаименованиеПолное
 //ИНН			
 //КПП	
 //НетКИ
 //КонтрагентОбмена - текущий Контрагент обмена
 //ПоискКонтрагент - Найденный КонтрагентРС 				
 //
 Процедура ЗаполнитьКИ(Структура)
	 
	 Для Каждого СтрКИКонтрагентОбмена Из Структура.КонтрагентОбмена.КонтактнаяИнформация Цикл 
		Отбор = Новый Структура; 
		Отбор.Вставить("Тип"			, СтрКИКонтрагентОбмена.Тип);
		Отбор.Вставить("Вид"			, СтрКИКонтрагентОбмена.Вид);
		Отбор.Вставить("Представление"	, СтрКИКонтрагентОбмена.Представление);   
		
		 МассивСтрок = Структура.ПоискКонтрагент.КонтактнаяИнформация.НайтиСтроки(Отбор); 
		 Если МассивСтрок.Количество() = 0 Тогда 
			  КонтрагентОбъект 	= Структура.ПоискКонтрагент.ПолучитьОбъект();
			  НоваяСтрока 		= КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			  ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрКИКонтрагентОбмена); 
			  КонтрагентОбъект.НетКИ = ложь;
			  КонтрагентОбъект.Записать();
		 КонецЕсли;		 
	 КонецЦикла;
	 
 КонецПроцедуры	 

&НаСервере
 Процедура ПустоеПредставлениеНаСервере()
	 
	 ВыборкаДетальныеЗаписи = РС_ОбщийМодульСервер.ПолучитьВыборкуКонтрагентовОбмен();  
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		 мУдалитьСтроки = Новый Массив;
		 Для Каждого СтрКИ Из ВыборкаДетальныеЗаписи.Ссылка.КонтактнаяИнформация Цикл
			 Если Не ЗначениеЗаполнено(СтрКИ.Представление) Тогда 
				 мУдалитьСтроки.Добавить(СтрКИ.НомерСтроки-1);
			 КонецЕсли;	
		 КонецЦикла;
		 Если Не мУдалитьСтроки.Количество() = 0 Тогда 
			 СпрОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			 к=0;
			 Для Каждого стрУдалитьСтроки из мУдалитьСтроки Цикл
				 СпрОбъект.КонтактнаяИнформация.Удалить(стрУдалитьСтроки-к);  
				 к=к+1;
			 КонецЦикла;
			 СпрОбъект.Записать();
		 КонецЕсли;	
	 КонецЦикла;
	 
 КонецПроцедуры
 
#КонецОбласти
